/**********************************************************************

 backwardアルゴリズム

  HMMモデルλが与えられたとき観測系列Oの確率 P(O|λ)を計算する。

  使用法: backward


       初版                                    2011年04月27日 高木一幸
       実習用にコードを削除して穴埋め部分作成  2011年05月17日 高木一幸
       2012年度用に穴埋め部分を調整　　　　　  2012年05月01日 高木一幸
       総合情報学科専門実験用のcodeを制作      2012年10月03日 高木一幸
       新年度用にパラメータを変更              2013年10月20日 高木一幸
       新年度用にパラメータを変更              2014年10月09日 高木一幸
       新年度用にパラメータを変更              2015年09月29日 高木一幸
       新年度用にパラメータを変更              2016年11月01日 高木一幸
       新年度用にパラメータを変更              2017年10月10日 高木一幸
       新年度用にパラメータを変更              2021年10月03日 高木一幸

**********************************************************************/
/*---------------------------------------------------------------------

 include files

---------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>





/*---------------------------------------------------------------------

 macros

---------------------------------------------------------------------*/
#define N               4                /* HMMの状態数              */
#define M               2                /* 出力シンボル種類数       */
#define T               4                /* 観測シンボル長("0110")   */





/*---------------------------------------------------------------------

 data definitions

---------------------------------------------------------------------*/
/* 状態遷移確率 */
double a[N][N] = 
  {
    {0.3, 0.4, 0.1, 0.2},
    {0.1, 0.3, 0.5, 0.1},
    {0.3, 0.1, 0.4, 0.2},
    {0.6, 0.1, 0.2, 0.1}
  };

/* シンボル出力確率 */
double b[N][M] = 
  {
      {0.8,0.2},
      {0.2,0.8},
      {0.6,0.4},
      {0.7,0.3},
  };

/* 初期状態確率 */
double pi[N] =
  {0.2,0.4,0.1,0.3};



/*---------------------------------------------------------------------

 function prototypes

---------------------------------------------------------------------*/
double backward(int O[T],                /* 観測記号列               */
		double a[N][N],          /* HMM状態遷移確率          */
		double b[N][M],          /* HMMシンボル出力確率      */
		double pi[N],            /* HMM初期状態確率          */
		double beta[T][N]        /* backward変数β           */
		);





/*---------------------------------------------------------------------


 main


---------------------------------------------------------------------*/
int main(int argc,char *argv[])
{
  int i;                                 /* 状態index                */   
  int t;                                 /* 時間index                */
  int O[T] = {0,1,1,0};                  /* 観測シンボル "0110"       */
  double beta[T][N];                     /* backward変数β           */
  double prob;                           /* backward確率             */


  /*------------------------------------
     backward変数βを計算
  ------------------------------------*/
  prob = backward(O,a,b,pi,beta);

  /*------------------------------------
    βの値をプリント
  ------------------------------------*/
  for(i=N-1; i>=0; i--) {
    for(t=0; t<T; t++) {
      printf("%10.8f\t",beta[t][i]);
    }
    printf("\n");
  }

  /*------------------------------------
     backward確率をプリント
  ------------------------------------*/
  printf("P(O|λ)= %10.8f\n",prob);

}





/*---------------------------------------------------------------------

 backward

---------------------------------------------------------------------*/
double backward(int O[T],                /* 観測記号列               */
		double a[N][N],          /* HMM状態遷移確率          */
		double b[N][M],          /* HMMシンボル出力確率      */
		double pi[N],            /* HMM初期状態確率          */
		double beta[T][N]        /* backward変数β           */
		)
{
  int i,j;                               /* 状態index                */
  int t;                                 /* 時間index                */
  double prob;                           /* backward確率             */


  /*------------------------------------
    初期化 (式5.8)
  ------------------------------------*/
  t = T-1;
  for(i=0; i<=N-1; i++) {
    beta[t][i] = 1.0; /* ここを穴埋め（済） */
  }
    
  /*------------------------------------
    再帰計算 (式5.9)
  ------------------------------------*/
  for(t=T-2; t>=0; t--) {
    for(i=0; i<N; i++) {
      beta[t][i] = 0.0;
      for(j=0; j<N; j++) {
	beta[t][i] += a[i][j] * b[j][O[t+1]] * beta[t+1][j] ;/* ここを穴埋め（済） */
      }
    }
  }

  /*------------------------------------
    backward確率の計算 (式5.10)
  ------------------------------------*/
  prob = 0.0;
  for(i=0; i<N; i++) {
    prob += pi[i] * b[i][0] * beta[0][i]; /* ここを穴埋め（済） */
  }

  return prob;
}
